In [1]:
# Import pandas package
import pandas as pd
import numpy as np

In [2]:
left = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (left)
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [3]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
   ....:                    "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
   ....:                    "data1" : np.random.standard_normal(7),
   ....:                    "data2" : np.random.standard_normal(7)})

df

   key1  key2     data1     data2
0     a     1  0.545014 -3.176398
1     a     2 -1.279666  1.089097
2  None     1  0.373560  0.359612
3     b     2  0.522839 -2.196610
4     b     1 -0.349404  0.831667
5     a  <NA> -0.019951  0.313291
6  None     1  0.713495  1.185637

In [4]:
grouped = df["data1"].groupby(df["key1"])

grouped

In [26]:
grouped.mean()

key1
a    1.101517
b    0.299952
Name: data1, dtype: float64

In [4]:
np.nan

nan

In [6]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                    [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
print(df)
# Aggregate these functions over the rows.
print(df.agg(["sum","mean","min"]))

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN
         A     B     C
sum   12.0  15.0  18.0
mean   4.0   5.0   6.0
min    1.0   2.0   3.0

In [12]:
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [29]:
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [9]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby("Year")
print (grouped.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [8]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [43]:
grouped=df.groupby("Year")

In [37]:
print (grouped.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [10]:
df["Rank"].unique()

array([1, 2, 3, 4], dtype=int64)

In [10]:
df.Team.unique()

array(['Riders', 'Devils', 'Kings', 'kings', 'Royals'], dtype=object)

In [11]:
from scipy import stats
import numpy as np
import statistics
x =np.array([9.2,10.7,6.8,9,3.4,5.7,5.7])
print("Mean")
print(np.mean(x))

Mean
7.214285714285715

In [12]:
print("Median")
print(np.median(x))

Median
6.8

In [13]:
print("Standard Deviation")
print(np.std(x))

Standard Deviation
2.3479039718916295

In [14]:
print("Variance")
print(np.var(x))

Variance
5.512653061224489

In [15]:
print("Mode")
print(statistics.mode(x))

Mode
5.7

In [39]:
5+6

11